Revit 2027 API
SolidGlass.SolidglassTransmittanceCustomColor Property
 The property labeled "Custom Color" from the "SolidGlass" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string SolidglassTransmittanceCustomColor { get; }
Public Shared ReadOnly Property SolidglassTransmittanceCustomColor As String
	Get
public:
static property String^ SolidglassTransmittanceCustomColor {
	String^ get ();
}
static member SolidglassTransmittanceCustomColor : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
See Also
Reference
SolidGlass Class
Autodesk.Revit.DB.Visual Namespace